Revit 2026 API

# ViewDraftingCreate Method

---

Creates a new ViewDrafting in the model.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ViewDrafting Create(
	Document document,
	ElementId viewFamilyTypeId
)
```
```vb
Public Shared Function Create (
	document As Document,
	viewFamilyTypeId As ElementId
) As ViewDrafting
```
```cpp
public:
static ViewDrafting^ Create(
	Document^ document,
	ElementId^ viewFamilyTypeId
)
```
```fsharp
static member Create :
        document : Document *
        viewFamilyTypeId : ElementId -> ViewDrafting
```

#### Parameters

document Document
     The document in which the new drafting view will be created.
viewFamilyTypeId ElementId
     The id of the ViewFamilyType that should be assigned to the new drafting view.

#### Return Value

ViewDrafting The newly created drafting view.

| Exception | Condition |
| --- | --- |
| ArgumentException | viewFamilyTypeId is not a valid ViewFamilyType for a drafting view. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ViewDrafting Class

Autodesk.Revit.DB Namespace